
endDate - endDateMillis // Время окончания события в миллисекундах

itemPx - widthItemPx // Ширина элемента в пикселях

beginDate - beginTimeMinute // Время начала события в миллисекундах

start - beginPhase // Начало определенного этапа или фазы в процессе.

SenderUtils - EmailSenderUtils // Имя класса со статичными методами для работы с почтой

value - valueToHash // Входной параметр для функции хэширования

total - moneyTotal // Общее количество денег

max - maxCountOfUsing // Поиск наибольшего числа в массиве

column - columnIndexToDisplay // Номер "колонки" в таблице, который будет отображен на экране. Используется для управления видимостью столбцов в табличной структуре данных.

volume - AudioLevel // Объект, в котором хранится информация об уровне звукового давления (громкости) во время проигрывания аудио.

Item - ItemCategory // Класс-наследник типа Category имеет постфикс типа Item. (Проект инвентарного менеджера)

proximity - proximityDotes // близость нахождения точек друг от друга