//1 Вынес в локальную функцию переменную isReportedLoaded при генерации отчета
//2 Вынес в локальную функцию переменную isFormCompanyDownload при выгрузке форм по компании
//3 Вынес в локальную функцию переменную isDrawLoaded при загрузке чертежа
//4 Сократил область видимости переменной companyInfo
//5 Сократил область видимости переменной employeeInfo
//6 Сократил область видимости переменной srcFormater, после использования занулил
//7 Сократил область видимости переменной defultProcent в методе
//8 Функционал калькулятора вынес в отдельный модуль и отключил видимость всех вспомогательных переменных, функций извне
//9 Сделал приватной переменную memoryStream
//10 Сократил область видимости переменной companyForm
//11 Сократил область видимости переменной pattern
//12 Сократил область видимости переменной color
//13 Функционал таблиц со временем вынес в отдельный модуль и отключил видимость всех вспомогательных переменных
//14 Переместил переменную chankDocReaded с переменной класса в локальную переменную функции
//15 Сократил область видимости переменной EventDetail